Makro/Pruebas/Prueba 19.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|1|F|SETT|4001144|2022-03-23|19:21:00|COP|4908|1|31|900059238|MAKRO SUPERMAYORISTA S.A.S|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|1|31|9010494382|CODESER SAS|CODESER SAS||||||MONTERIA|CR 13B 61 07|CO|49|15869757.58|15562227.58|18369052.00|0|0|0|18369052.00
ENEX|UBL 2.1|10|||||||2022-02-01||19:21:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|Cordoba|23|Cra.  14  No.  48 A 42 |CO|Colombia|5|31||5 |23001|MONTERIA|Cordoba|23|CR 13B 61 07|CO|Colombia|2|31|56.00|16FD|01552666|23|Colombia|23001|Cordoba|Colombia|23|111711|111711|
RS|2019-01-19|2030-01-19|SETT|1|50000000||18760000001
DE|1|988104|BG|11|3788.57|41674.29||0.00||false
DEDI|PASTA COMARRICO CARACOL 1000g
DEDI|43758.00
DEDIEX||999|1|||
DEIM|2083.70|41674.29|2083.70|5.00|01|IVA||BG|189.427272727272727272727272727272727273
DE|2|988117|BG|15|3788.57|56828.57||0.00||false
DEDI|PASTA COMARRICO TORNILLO 1000g
DEDI|59670.00
DEDIEX||999|1|||
DEIM|2841.42|56828.57|2841.42|5.00|01|IVA||BG|189.428
DE|3|119838|C62|5|28714.29|143571.43||0.00||false
DEDI|PONY MALTA MINI PET 200ccX30u
DEDI|170850.00
DEDIEX||999|1|||
DEIM|27278.56|143571.43|27278.56|19.00|01|IVA||C62|5455.712
DE|4|65611|BG|6|27234.00|163404.00||0.00||false
DEDI|FRIJOL CARGAMANTO ARO ROJO 3000g
DEDI|163404.00
DEDIEX||999|1|||
DEIM|0.00|163404.00|0.00|0.00|01|IVA||BG|0
DE|5|643851|C62|50|36210.00|1810500.00||0.00||false
DEDI|ARROZ ZULIA 500gX25u
DEDI|1810500.00
DEDIEX||999|1|||
DEIM|0.00|1810500.00|0.00|0.00|01|IVA||C62|0
DE|6|120865|C62|10|13371.43|133714.29||0.00||false
DEDI|MAYONESA FRUCO LIGHT DP 380g
DEDI|159120.00
DEDIEX||999|1|||
DEIM|25405.70|133714.29|25405.70|19.00|01|IVA||C62|2540.57
DE|7|76024|BO|10|10300.00|103000.00||0.00||false
DEDI|VINAGRE BLANCO ARO PET 4l
DEDI|122570.00
DEDIEX||999|1|||
DEIM|19569.99|103000.00|19569.99|19.00|01|IVA||BO|1956.999
DE|8|99576|GRM|20|10213.45|204268.91||0.00||false
DEDI|GELATINA BOGGY PREMIO SURT108GX6U
DEDI|243080.00
DEDIEX||999|1|||
DEIM|38811.08|204268.91|38811.08|19.00|01|IVA||GRM|1940.554
DE|9|111806|BG|45|47828.57|2152285.71||0.00||false
DEDI|ACEITE GIRASOL COUNTRYRANCH5000ml
DEDI|2561220.00
DEDIEX||999|1|||
DEIM|408934.27|2152285.71|408934.27|19.00|01|IVA||BG|9087.428222222222222222222222222222222222
DE|10|123905|C62|96|2163.87|207731.09||0.00||false
DEDI|COMPOTA RESPIN MANZANA 113g
DEDI|247200.00
DEDIEX||999|1|||
DEIM|39468.90|207731.09|39468.90|19.00|01|IVA||C62|411.134375
DE|11|137495|C62|5|11057.14|55285.71||0.00||false
DEDI|COLCAFE CAPPUCINO VAINILLA 200g
DEDI|65790.00
DEDIEX||999|1|||
DEIM|10504.27|55285.71|10504.27|19.00|01|IVA||C62|2100.854
DE|12|106781|C62|120|3635.29|436235.29||0.00||false
DEDI|GTASALTIN NOEL QSOMQLLA202gEN9u
DEDI|519120.00
DEDIEX||999|1|||
DEIM|82884.69|436235.29|82884.69|19.00|01|IVA||C62|690.70575
DE|13|75556|BO|15|7703.36|115550.42||0.00||false
DEDI|SALSA SOYA ARO PET 1l
DEDI|137505.00
DEDIEX||999|1|||
DEIM|21954.57|115550.42|21954.57|19.00|01|IVA||BO|1463.638
DE|14|115516|C62|3|10300.00|30900.00||0.00||false
DEDI|BEBIDA REFRES SAVILOE 320mlX6u
DEDI|36771.00
DEDIEX||999|1|||
DEIM|5870.99|30900.00|5870.99|19.00|01|IVA||C62|1956.996666666666666666666666666666666667
DE|15|100548|C62|4|14627.73|58510.92||0.00||false
DEDI|SALCHICHA RANCHERA PREMI480GEN14U
DEDI|69628.00
DEDIEX||999|1|||
DEIM|11117.06|58510.92|11117.06|19.00|01|IVA||C62|2779.265
DE|16|122339|C62|20|4565.71|91314.29||0.00||false
DEDI|HARINA DE MAIZ DONAREPA AMAR 1kg
DEDI|95880.00
DEDIEX||999|1|||
DEIM|4565.70|91314.29|4565.70|5.00|01|IVA||C62|228.285
DE|17|104302|BG|10|6120.00|61200.00||0.00||false
DEDI|PASTA MONTICELLO PENNE RIGATE500g
DEDI|64260.00
DEDIEX||999|1|||
DEIM|3059.99|61200.00|3059.99|5.00|01|IVA||BG|305.999
DE|18|56529|BG|20|10819.33|216386.56||0.00||false
DEDI|COLADA TONING 7CEREAL NAT 1000g
DEDI|257500.00
DEDIEX||999|1|||
DEIM|41113.43|216386.56|41113.43|19.00|01|IVA||BG|2055.6715
DE|19|119840|C62|5|32742.86|163714.29||0.00||false
DEDI|PONY MALTA PET 330ccX24u
DEDI|194820.00
DEDIEX||999|1|||
DEIM|31105.70|163714.29|31105.70|19.00|01|IVA||C62|6221.14
DE|20|196040|C62|1|4327.73|4327.73||0.00||false
DEDI|BICARBONATO ARO BOL 500g
DEDI|5150.00
DEDIEX||999|1|||
DEIM|822.26|4327.73|822.26|19.00|01|IVA||C62|822.26
DE|21|75322|C62|3|13762.19|41286.56||0.00||false
DEDI|ALCAPARRA ARO VINAGRE FCO 1000g
DEDI|49131.00
DEDIEX||999|1|||
DEIM|7844.43|41286.56|7844.43|19.00|01|IVA||C62|2614.81
DE|22|177879|C62|5|26568.07|132840.34||0.00||false
DEDI|MAIZ MCCAIN DESGRANADO BOL 2Kg
DEDI|158080.00
DEDIEX||999|1|||
DEIM|25239.65|132840.34|25239.65|19.00|01|IVA||C62|5047.93
DE|23|46314|BG|50|13983.19|699159.66||0.00||false
DEDI|ARVEJA MCCAIN BOL 1kg
DEDI|832000.00
DEDIEX||999|1|||
DEIM|132840.32|699159.66|132840.32|19.00|01|IVA||BG|2656.8064
DE|24|832845|CH|20|147257.14|2945142.86||0.00||false
DEDI|PELICULA DARNEL WRAP 300mmX1500m
DEDI|3504720.00
DEDIEX||999|1|||
DEIM|559577.13|2945142.86|559577.13|19.00|01|IVA||CH|27978.8565
DE|25|27599|C62|7|3685.71|25800.00||0.00||false
DEDI|MEZCLADOR PLASTICO ARO 1000u
DEDI|30702.00
DEDIEX||999|1|||
DEIM|4901.99|25800.00|4901.99|19.00|01|IVA||C62|700.284285714285714285714285714285714286
DE|26|107510|BG|5|13675.63|68378.15||0.00||false
DEDI|FINAS HBAS GRANAROMA DESHID 200g
DEDI|81370.00
DEDIEX||999|1|||
DEIM|12991.84|68378.15|12991.84|19.00|01|IVA||BG|2598.368
DE|27|119507|C62|16|14769.75|236315.97||0.00||false
DEDI|ESPONJA MAQUINA DESSIN 12u
DEDI|281216.00
DEDIEX||999|1|||
DEIM|44900.02|236315.97|44900.02|19.00|01|IVA||C62|2806.25125
DE|28|27313|C62|1|29914.29|29914.29||0.00||false
DEDI|PASTA TOMATE ARO FCO 4000g
DEDI|35598.00
DEDIEX||999|1|||
DEIM|5683.70|29914.29|5683.70|19.00|01|IVA||C62|5683.7
DE|29|43956|BG|10|21725.21|217252.10||0.00||false
DEDI|PANO BARRON VIEYRA BLANCO 174h
DEDI|258530.00
DEDIEX||999|1|||
DEIM|41277.89|217252.10|41277.89|19.00|01|IVA||BG|4127.789
DE|30|119858|C62|60|6514.29|390857.14||0.00||false
DEDI|PREMEZCLA PANCAKES CORONA 630g
DEDI|465120.00
DEDIEX||999|1|||
DEIM|74262.85|390857.14|74262.85|19.00|01|IVA||C62|1237.714166666666666666666666666666666667
DE|31|370370|BG|29|4614.29|133814.29||0.00||false
DEDI|AZUCAR BLANCA INCAUCA 5gX200u
DEDI|140505.00
DEDIEX||999|1|||
DEIM|6690.70|133814.29|6690.70|5.00|01|IVA||BG|230.71379310344827586206896551724137931
DE|32|478712|BG|9|4565.71|41091.43||0.00||false
DEDI|PASTA DORIA CONCHAS 1000g
DEDI|43146.00
DEDIEX||999|1|||
DEIM|2054.56|41091.43|2054.56|5.00|01|IVA||BG|228.284444444444444444444444444444444444
DE|33|428558|C62|2|10126.89|20253.78||0.00||false
DEDI|MARGARINA CAMPI SAL 500g
DEDI|24102.00
DEDIEX||999|1|||
DEIM|3848.21|20253.78|3848.21|19.00|01|IVA||C62|1924.105
DE|34|123906|C62|24|2163.87|51932.77||0.00||false
DEDI|COMPOTA RESPIN PERA 113g
DEDI|61800.00
DEDIEX||999|1|||
DEIM|9867.22|51932.77|9867.22|19.00|01|IVA||C62|411.134166666666666666666666666666666667
DE|35|115151|BG|20|4031.43|80628.57||0.00||false
DEDI|HARINA DE MAIZ PAN BLANCA 1kg
DEDI|84660.00
DEDIEX||999|1|||
DEIM|4031.42|80628.57|4031.42|5.00|01|IVA||BG|201.571
DE|36|549068|CH|20|10819.33|216386.56||0.00||false
DEDI|AVENA INST TONING VAINILLA 1000g
DEDI|257500.00
DEDIEX||999|1|||
DEIM|41113.43|216386.56|41113.43|19.00|01|IVA||CH|2055.6715
DE|37|39845|BG|16|15985.71|255771.43||0.00||false
DEDI|BEB PVO CHOCOEXPRESS AZC 1000g
DEDI|304368.00
DEDIEX||999|1|||
DEIM|48596.56|255771.43|48596.56|19.00|01|IVA||BG|3037.285
DE|38|687544|BG|9|19474.79|175273.11||0.00||false
DEDI|LECHE PVO SOYA TONING NAT 1000g
DEDI|208575.00
DEDIEX||999|1|||
DEIM|33301.88|175273.11|33301.88|19.00|01|IVA||BG|3700.208888888888888888888888888888888889
DE|39|108502|CH|40|9089.08|363563.03||0.00||false
DEDI|MAIZ ARO 1000g
DEDI|432640.00
DEDIEX||999|1|||
DEIM|69076.96|363563.03|69076.96|19.00|01|IVA||CH|1726.924
DE|40|100865|C62|4|21000.00|84000.00||0.00||false
DEDI|ACEITE OLIVA ARO EXTRA VIRGEN 1l
DEDI|99960.00
DEDIEX||999|1|||
DEIM|15959.99|84000.00|15959.99|19.00|01|IVA||C62|3989.9975
DE|41|130764|CH|4|11252.10|45008.40||0.00||false
DEDI|NATURAL MANI MOTO 48gX12u
DEDI|53560.00
DEDIEX||999|1|||
DEIM|8551.59|45008.40|8551.59|19.00|01|IVA||CH|2137.8975
DE|42|67340|C62|3|20298.00|60894.00||0.00||false
DEDI|GARBANZO ARO 3000g
DEDI|60894.00
DEDIEX||999|1|||
DEIM|0.00|60894.00|0.00|0.00|01|IVA||C62|0
DE|43|947154|BG|2|6837.82|13675.63||0.00||false
DEDI|CLAVO ENTERO EL REY BOL 80g
DEDI|16274.00
DEDIEX||999|1|||
DEIM|2598.36|13675.63|2598.36|19.00|01|IVA||BG|1299.18
DE|44|132351|C62|10|3375.63|33756.30||0.00||false
DEDI|LAUREL GRANAROMA 10g
DEDI|40170.00
DEDIEX||999|1|||
DEIM|6413.69|33756.30|6413.69|19.00|01|IVA||C62|641.369
DE|45|420459|C62|5|15493.28|77466.39||0.00||false
DEDI|CHAMPINON ARO CORTADO FCO 1000g
DEDI|92185.00
DEDIEX||999|1|||
DEIM|14718.60|77466.39|14718.60|19.00|01|IVA||C62|2943.72
DE|46|196339|C62|2|8222.69|16445.38||0.00||false
DEDI|PIMIENTA MZCLA CONDI ARO BOL 500g
DEDI|19570.00
DEDIEX||999|1|||
DEIM|3124.61|16445.38|3124.61|19.00|01|IVA||C62|1562.305
DE|47|44395|C62|15|13362.00|200430.00||0.00||false
DEDI|PANELA COLOMBIA GRANUL NAT 1500g
DEDI|200430.00
DEDIEX||999|1|||
DE|48|106374|C62|120|3635.29|436235.29||0.00||false
DEDI|GTA SALUDABLE DUX INTEGRAL 250g
DEDI|519120.00
DEDIEX||999|1|||
DEIM|82884.69|436235.29|82884.69|19.00|01|IVA||C62|690.70575
DE|49|1305|BG|20|10819.33|216386.56||0.00||false
DEDI|AVENA INST TONING FRESA 1000g
DEDI|257500.00
DEDIEX||999|1|||
DEIM|41113.43|216386.56|41113.43|19.00|01|IVA||BG|2055.6715
DE|50|287014|C62|15|41978.99|629684.87||0.00||false
DEDI|MOSTAZA FRUCO PET 4015g
DEDI|749325.00
DEDIEX||999|1|||
DEIM|119640.11|629684.87|119640.11|19.00|01|IVA||C62|7976.007333333333333333333333333333333333
DE|51|102895|BG|20|18089.92|361798.32||0.00||false
DEDI|PAPRIKA DUL GRANAROMA DESHID 500g
DEDI|430540.00
DEDIEX||999|1|||
DEIM|68741.67|361798.32|68741.67|19.00|01|IVA||BG|3437.0835
DE|52|113466|C62|120|5279.83|633579.83||0.00||false
DEDI|GALLETA TOSH MIEL 30gX9u
DEDI|753960.00
DEDIEX||999|1|||
DEIM|120380.16|633579.83|120380.16|19.00|01|IVA||C62|1003.168
DE|53|75517|BO|5|5106.72|25533.61||0.00||false
DEDI|SALSA NEGRA ARO PET 1l
DEDI|30385.00
DEDIEX||999|1|||
DEIM|4851.38|25533.61|4851.38|19.00|01|IVA||BO|970.276
DE|54|119842|C62|20|2657.14|53142.86||0.00||false
DEDI|PONY MALTA PET 1.5l
DEDI|63240.00
DEDIEX||999|1|||
DEIM|10097.13|53142.86|10097.13|19.00|01|IVA||C62|504.8565
DE|55|306852|BG|70|1530.00|107100.00||0.00||false
DEDI|SAL REFISAL ALTA PUREZA 1000g
DEDI|107100.00
DEDIEX||999|1|||
DE|56|106547|C62|120|4154.62|498554.62||0.00||false
DEDI|GTA SLDABL CLUB SOCIAL INT 234g
DEDI|593280.00
DEDIEX||999|1|||
DEIM|94725.37|498554.62|94725.37|19.00|01|IVA||C62|789.378083333333333333333333333333333333
DIT|2499294.98
DI||2034798.00|0.00|0|01|0.00|IVA||
DI||13020878.00|2473966.99|19|01|2473966.99|IVA||
DI||506551.00|25327.99|5|01|25327.99|IVA||
PE|prom|0
PE|zona|16012525
PE|idInterno|167 202232565
PE|Caja|7 42
PE|CentroDistribucion|MAKRO MONTERIA
PE|TelCentroDistribucion|7849899
PE|PasaporteCliente|16 21730960
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|BarrioCliente|N/A
PE|TelefonoCliente|3214249810
PE|CorreoDist|gisellaherazog@gmail.com
PE|CodigoBarras|220325651921070420155
PE|vrCreditoDirecto|18.369.052,00
FP|1|ZZZ|2022-02-01|257560901
PE|Plantilla|T01_MBS.jasper
PE|Impresora|10.51.33.72
PE|Copias|3
PE|PPLTienda|ST16
PE|PPLCaja|99
PES|ResolucionesFactura
PESD|1|AGENTE RETENEDOR DE IVARESOLUCION 00812 30/01/2006
PESD|2|Somos REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|3|Somos AUTORETENEDORES DEL IMPUESTO DE RENTA SEGUN RESOL No 1524 DE FEB 20 DE 2006
PES|TextoInformativoFactura
PESD|1|ACEPTO QUE HE RECIBIDO, LOS BIENES DESCRITOS Y LA PRESENTE FACTURA, EN LA FECHA DE EXPEDICION DE LA MISMA Y ACEPTO LA PRESENTE FACTURA Y LAS OBLIGACIONES CONTENIDAS EN ELLA
PESD|2|LA PRESENTE FACTURA VENCE A LOS TREINTA  (30) DIAS CORRIENTES CONTADOS A PARTIR DE LA EXPEDICION DE LA MISMA
PESD|3|LA PRESENTE FACTURA CAMBIARIA DE COMPRAVENTA SE ASIMILA A LETRA DE CAMBIO (ART. 774 DEL CODIGO DE COMERCIO)
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020 CAMBIOS DENTRO DE LOS 7 DIAS HABILES A PARTIR DE LA COMPRA,PRESENTA LA FACTURA
PESD|2|Observaciones: S/N
CTE||||dte_9000592385@dte.paperless.com.co|
CTR||||info@spsmarine.com|
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01</tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope> 